Revit 2026 API

# RebarSpliceTypeUtils Class

---

Utility class for dealing with Rebar Splice Type operations. To find all Rebar Splice Types in the document can be done using FilteredElementCollector of category BuiltInCategory.OST_RebarSpliceType.

SystemObject Autodesk.Revit.DB.StructureRebarSpliceTypeUtils

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RebarSpliceTypeUtils
```
```vb
Public NotInheritable Class RebarSpliceTypeUtils
```
```cpp
public ref class RebarSpliceTypeUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarSpliceTypeUtils = class end
```

The RebarSpliceTypeUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateRebarSpliceType | Creates a Rebar Splice Type element. |
|  | GetAllRebarSpliceTypes | Gets all the Rebar Splice Types elements from the document. |
|  | GetLapLengthMultiplier | Gets the lap length multiplier value. |
|  | GetShiftOption | Identifies the way bars are shifted in the splice relation. |
|  | GetStaggerLengthMultiplier | Gets the stagger multiplier value. |
|  | SetLapLengthMultiplier | Sets the lap length multiplier value. |
|  | SetShiftOption | Sets the way bars are shifted in the splice relation. |
|  | SetStaggerLengthMultiplier | Sets the lap length multiplier value. |

#### Reference

Autodesk.Revit.DB.Structure Namespace